PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_syslib.h
#include "cy_device.h"

#if defined (CY_IP_M33SYSCPUSS) || defined (CY_IP_M4CPUSS) || defined (CY_IP_M7CPUSS) || defined(CY_IP_M55APPCPUSS)

#include <stdint.h>
#include <stdbool.h>
#include "cy_utils.h"
#include "cy_result.h"

#if defined(__cplusplus)
extern "C" {
#endif /* defined(__cplusplus) */

#if defined( __ICCARM__ )
/* Suppress the warning for multiple volatile variables in an expression. */
/* This is common for driver's code and the usage is not order-dependent. */
#pragma diag_suppress=Pa082
#endif  /* defined( __ICCARM__ ) */

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 8.6', 3, \
                             'Coverity does not check the .S assembly files, the definition is a part of syslib assembly source file.')

/**
* \addtogroup group_syslib_macros
* \{
*/

/******************************************************************************
* Macros
*****************************************************************************/

/** The macro for ARM CORTEX CM0P */
#define CY_CPU_CORTEX_M0P   (__CORTEX_M == 0U)    /**< CM0+ core CPU Code */
/** The macro for ARM CORTEX CM4 */
#define CY_CPU_CORTEX_M4    (__CORTEX_M == 4U)    /**< CM4  core CPU Code */
/** The macro for ARM CORTEX CM7 */
#define CY_CPU_CORTEX_M7    (__CORTEX_M == 7U)    /**< CM7  core CPU Code */
/** The macro for ARM CORTEX CM55 */
#define CY_CPU_CORTEX_M55    (__CORTEX_M == 55U)  /**< CM55 core CPU Code */
/** The macro for ARM CORTEX CM33 */
#define CY_CPU_CORTEX_M33    (__CORTEX_M == 33U)  /**< CM33 core CPU Code */

/** The macro to enable the Fault Handler */
#define CY_ARM_FAULT_DEBUG_ENABLED     (1U)

#if !defined (CY_ARM_FAULT_DEBUG)
/** The macro defines if the Fault Handler is enabled. Enabled by default. */
#define CY_ARM_FAULT_DEBUG         (CY_ARM_FAULT_DEBUG_ENABLED)
#endif /* CY_ARM_FAULT_DEBUG */

/** This macro is to be enabled and set appropriately for the CPU's which has
 * branch prediction enabled, so the delay can work accurately.
 * CY_SYSLIB_DELAY_CALIBRATION_FACTOR = 1 for CM0P, CM33 and CM4.
 * CY_SYSLIB_DELAY_CALIBRATION_FACTOR = 2 for CM7_0 and CM7_1.
 */
#ifndef CY_SYSLIB_DELAY_CALIBRATION_FACTOR
#define CY_SYSLIB_DELAY_CALIBRATION_FACTOR     1U
#endif

/**
* \defgroup group_syslib_macros_status_codes Status codes
* \{
* Function status type codes
*/
/** \cond INTERNAL */

#define CY_PDL_STATUS_CODE_Pos  (CY_RSLT_CODE_POSITION)     /**< The module status code position in the status code */
#define CY_PDL_STATUS_TYPE_Pos  (CY_RSLT_TYPE_POSITION)     /**< The status type position in the status code */
#define CY_PDL_MODULE_ID_Pos    (CY_RSLT_MODULE_POSITION)   /**< The software module ID position in the status code */
#define CY_PDL_STATUS_INFO      ((uint32_t)CY_RSLT_TYPE_INFO << CY_PDL_STATUS_TYPE_Pos)     /**< The information status type */
#define CY_PDL_STATUS_WARNING   ((uint32_t)CY_RSLT_TYPE_WARNING << CY_PDL_STATUS_TYPE_Pos)  /**< The warning status type */
#define CY_PDL_STATUS_ERROR     ((uint32_t)CY_RSLT_TYPE_ERROR << CY_PDL_STATUS_TYPE_Pos)    /**< The error status type */
#define CY_PDL_MODULE_ID_Msk    (CY_RSLT_MODULE_MASK)       /**< The software module ID mask */

/** \endcond */

/** Get the software PDL module ID */
#define CY_PDL_DRV_ID(id)       ((uint32_t)((uint32_t)((id) & CY_PDL_MODULE_ID_Msk) << CY_PDL_MODULE_ID_Pos))
#define CY_SYSLIB_ID            CY_PDL_DRV_ID(0x11U)     /**< SYSLIB PDL ID */
/** \} group_syslib_macros_status_codes */

/** \} group_syslib_macros */

/**
* \addtogroup group_syslib_enumerated_types
* \{
*/

/** The SysLib status code structure. */
typedef enum
{
    CY_SYSLIB_SUCCESS       = 0x00UL,    /**< The success status code */
    CY_SYSLIB_BAD_PARAM     = CY_SYSLIB_ID | CY_PDL_STATUS_ERROR | 0x01UL,    /**< The bad parameter status code */
    CY_SYSLIB_TIMEOUT       = CY_SYSLIB_ID | CY_PDL_STATUS_ERROR | 0x02UL,    /**< The time out status code */
    CY_SYSLIB_INVALID_STATE = CY_SYSLIB_ID | CY_PDL_STATUS_ERROR | 0x03UL,    /**< The invalid state status code */
    CY_SYSLIB_UNKNOWN       = CY_SYSLIB_ID | CY_PDL_STATUS_ERROR | 0xFFUL     /**< Unknown status code */
} cy_en_syslib_status_t;

#if !defined(CY_IP_MXS40SSRSS)
/** The Life Cycle Stage(LCS) enum. */
typedef enum
{
    CY_SYSLIB_LCS_VIRGIN              = 0x0000UL,   /**< LCS Mode: VIRGIN */
    CY_SYSLIB_LCS_SORT                = 0x0003UL,   /**< LCS Mode: SORT */
    CY_SYSLIB_LCS_PROVISIONED         = 0x000FUL,   /**< LCS Mode: PROVISIONED */
    CY_SYSLIB_LCS_NORMAL_PROVISIONED  = 0x0C0FUL,   /**< LCS Mode: NORMAL-PROVISIONED*/
    CY_SYSLIB_LCS_NORMAL              = 0x0C03UL,   /**< LCS Mode: NORMAL */
    CY_SYSLIB_LCS_SECURE              = 0x0C3FUL,   /**< LCS Mode: SECURE */
    CY_SYSLIB_LCS_NORMAL_NO_SECURE    = 0x0CC3UL,   /**< LCS Mode: NORMAL_NO_SECURE */
    CY_SYSLIB_LCS_RMA                 = 0x0F3FUL,   /**< LCS Mode: RMA */
    CY_SYSLIB_LCS_CORRUPTED           = 0xFFFFUL,   /**< LCS Mode: CORRUPTED */
} cy_en_syslib_lcs_mode_t;
#endif /* defined(CY_IP_MXS40SSRSS) */

/** \} group_syslib_enumerated_types */
/**
* \addtogroup group_syslib_data_structures
* \{
*/

#if (CY_ARM_FAULT_DEBUG == CY_ARM_FAULT_DEBUG_ENABLED)
#if (CY_CPU_CORTEX_M4 || (defined (CY_CPU_CORTEX_M7) && CY_CPU_CORTEX_M7) || \
        (defined (CY_CPU_CORTEX_M33) && CY_CPU_CORTEX_M33) || (defined (CY_CPU_CORTEX_M55) && CY_CPU_CORTEX_M55))
/** Configurable Fault Status Register - CFSR */
typedef struct
{
    /** MemManage Fault Status Sub-register - MMFSR */
    uint32_t iaccViol    : 1;  /**< MemManage Fault - The instruction access violation flag */
    uint32_t daccViol    : 1;  /**< MemManage Fault - The data access violation flag */
    uint32_t reserved1   : 1;  /**< Reserved */
    uint32_t mUnstkErr   : 1;  /**< MemManage Fault - Unstacking for a return from exception */
    uint32_t mStkErr     : 1;  /**< MemManage Fault - MemManage fault on stacking for exception entry */
    uint32_t mlspErr     : 1;  /**< MemManage Fault - MemManage fault occurred during floating-point lazy state preservation */
    uint32_t reserved2   : 1;  /**< Reserved */
    uint32_t mmarValid   : 1;  /**< MemManage Fault - The MemManage Address register valid flag */
    /** Bus Fault Status Sub-register - UFSR */
    uint32_t iBusErr     : 1;  /**< Bus Fault - The instruction bus error */
    uint32_t precisErr   : 1;  /**< Bus Fault - The precise Data bus error */
    uint32_t imprecisErr : 1;  /**< Bus Fault - The imprecise data bus error */
    uint32_t unstkErr    : 1;  /**< Bus Fault - Unstacking for an exception return has caused one or more bus faults */
    uint32_t stkErr      : 1;  /**< Bus Fault - Stacking for an exception entry has caused one or more bus faults */
    uint32_t lspErr      : 1;  /**< Bus Fault - A bus fault occurred during the floating-point lazy state */
    uint32_t reserved3   : 1;  /**< Reserved */
    uint32_t bfarValid   : 1;  /**< Bus Fault - The bus fault address register valid flag */
    /** Usage Fault Status Sub-register - UFSR */
    uint32_t undefInstr  : 1;  /**< Usage Fault - An undefined instruction */
    uint32_t invState    : 1;  /**< Usage Fault - The invalid state */
    uint32_t invPC       : 1;  /**< Usage Fault - An invalid PC */
    uint32_t noCP        : 1;  /**< Usage Fault - No coprocessor */
    uint32_t reserved4   : 4;  /**< Reserved */
    uint32_t unaligned   : 1;  /**< Usage Fault - Unaligned access */
    uint32_t divByZero   : 1;  /**< Usage Fault - Divide by zero */
    uint32_t reserved5   : 6;  /**< Reserved */
} cy_stc_fault_cfsr_t;

/** Hard Fault Status Register - HFSR */
typedef struct
{
    uint32_t reserved1   :  1;   /**< Reserved. */
    uint32_t vectTbl     :  1;   /**< HFSR - Indicates a bus fault on a vector table read during exception processing */
    uint32_t reserved2   : 28;   /**< Reserved. */
    uint32_t forced      :  1;   /**< HFSR - Indicates a forced hard fault */
    uint32_t debugEvt    :  1;   /**< HFSR - Reserved for the debug use.  */
} cy_stc_fault_hfsr_t;

/** System Handler Control and State Register - SHCSR */
typedef struct
{
    uint32_t memFaultAct    :  1;   /**< SHCSR - The MemManage exception active bit, reads as 1 if the exception is active */
    uint32_t busFaultAct    :  1;   /**< SHCSR - The BusFault exception active bit, reads as 1 if the exception is active */
    uint32_t reserved1      :  1;   /**< Reserved. */
    uint32_t usgFaultAct    :  1;   /**< SHCSR - The UsageFault exception active bit, reads as 1 if the exception is active */
    uint32_t reserved2      :  3;   /**< Reserved. */
    uint32_t svCallAct      :  1;   /**< SHCSR - The SVCall active bit, reads as 1 if the SVC call is active */
    uint32_t monitorAct     :  1;   /**< SHCSR - The debug monitor active bit, reads as 1 if the debug monitor is active */
    uint32_t reserved3      :  1;   /**< Reserved. */
    uint32_t pendSVAct      :  1;   /**< SHCSR - The PendSV exception active bit, reads as 1 if the exception is active */
    uint32_t sysTickAct     :  1;   /**< SHCSR - The SysTick exception active bit, reads as 1 if the exception is active  */
    uint32_t usgFaultPended :  1;   /**< SHCSR - The UsageFault exception pending bit, reads as 1 if the exception is pending */
    uint32_t memFaultPended :  1;   /**< SHCSR - The MemManage exception pending bit, reads as 1 if the exception is pending */
    uint32_t busFaultPended :  1;   /**< SHCSR - The BusFault exception pending bit, reads as 1 if the exception is pending */
    uint32_t svCallPended   :  1;   /**< SHCSR - The SVCall pending bit, reads as 1 if the exception is pending */
    uint32_t memFaultEna    :  1;   /**< SHCSR - The MemManage enable bit, set to 1 to enable */
    uint32_t busFaultEna    :  1;   /**< SHCSR - The BusFault enable bit, set to 1 to enable */
    uint32_t usgFaultEna    :  1;   /**< SHCSR - The UsageFault enable bit, set to 1 to enable */
    uint32_t reserved4      : 13;   /**< Reserved */
} cy_stc_fault_shcsr_t;
#endif /* CY_CPU_CORTEX_M4, CY_CPU_CORTEX_M7, CY_CPU_CORTEX_M33, CY_CPU_CORTEX_M55*/

/** The fault configuration structure. */
typedef struct
{
    uint32_t r0;       /**< R0 register content */
    uint32_t r1;       /**< R1 register content */
    uint32_t r2;       /**< R2 register content */
    uint32_t r3;       /**< R3 register content */
    uint32_t r12;      /**< R12 register content */
    uint32_t lr;       /**< LR register content */
    uint32_t pc;       /**< PC register content */
    uint32_t psr;      /**< PSR register content */
#if (CY_CPU_CORTEX_M4 || (defined (CY_CPU_CORTEX_M7) && CY_CPU_CORTEX_M7) || \
             (defined (CY_CPU_CORTEX_M33) && CY_CPU_CORTEX_M33) || (defined (CY_CPU_CORTEX_M55) && CY_CPU_CORTEX_M55))
    union
    {
        uint32_t cfsrReg;              /**< CFSR register content as a word */
        cy_stc_fault_cfsr_t cfsrBits;  /**< CFSR register content as a structure */
    } cfsr;
    union
    {
        uint32_t hfsrReg;              /**< HFSR register content as a word */
        cy_stc_fault_hfsr_t hfsrBits;  /**< HFSR register content as a structure */
    } hfsr;
    union
    {
        uint32_t shcsrReg;              /**< SHCSR register content as a word */
        cy_stc_fault_shcsr_t shcsrBits; /**< SHCSR register content as a structure */
    } shcsr;
    uint32_t mmfar;                /**< MMFAR register content */
    uint32_t bfar;                 /**< BFAR register content */
#if ((defined (__FPU_PRESENT) && (__FPU_PRESENT == 1U)) && \
                 (defined (__FPU_USED   ) && (__FPU_USED    == 1U)))
    uint32_t s0;       /**< FPU S0 register content */
    uint32_t s1;       /**< FPU S1 register content */
    uint32_t s2;       /**< FPU S2 register content */
    uint32_t s3;       /**< FPU S3 register content */
    uint32_t s4;       /**< FPU S4 register content */
    uint32_t s5;       /**< FPU S5 register content */
    uint32_t s6;       /**< FPU S6 register content */
    uint32_t s7;       /**< FPU S7 register content */
    uint32_t s8;       /**< FPU S8 register content */
    uint32_t s9;       /**< FPU S9 register content */
    uint32_t s10;      /**< FPU S10 register content */
    uint32_t s11;      /**< FPU S11 register content */
    uint32_t s12;      /**< FPU S12 register content */
    uint32_t s13;      /**< FPU S13 register content */
    uint32_t s14;      /**< FPU S14 register content */
    uint32_t s15;      /**< FPU S15 register content */
    uint32_t fpscr;    /**< FPU FPSCR register content */
#endif /* __FPU_PRESENT */
#endif /* CY_CPU_CORTEX_M4, CY_CPU_CORTEX_M7, CY_CPU_CORTEX_M33, CY_CPU_CORTEX_M55*/
} cy_stc_fault_frame_t;
#endif /* (CY_ARM_FAULT_DEBUG == CY_ARM_FAULT_DEBUG_ENABLED) */

/** \} group_syslib_data_structures */

/**
* \addtogroup group_syslib_macros
* \{
*/

/** The driver major version */
#define CY_SYSLIB_DRV_VERSION_MAJOR    3

/** The driver minor version */
#define CY_SYSLIB_DRV_VERSION_MINOR    80

/** Define start of the function placed to the SRAM area by the linker */
#ifndef CY_SECTION_RAMFUNC_BEGIN
#if defined (__ICCARM__)
#define CY_SECTION_RAMFUNC_BEGIN CY_PRAGMA(diag_suppress = Ta023) __ramfunc
#else
#define CY_SECTION_RAMFUNC_BEGIN CY_SECTION(".cy_ramfunc")
#endif
#endif

/** Define end of the function placed to the SRAM area by the linker */
#ifndef CY_SECTION_RAMFUNC_END
#if defined (__ICCARM__)
#define CY_SECTION_RAMFUNC_END CY_PRAGMA(diag_default = Ta023)
#else
#define CY_SECTION_RAMFUNC_END
#endif
#endif

/** Define start of the function placed to the SRAM1 area by the linker */
#ifndef CY_SECTION_SRAM1_CODE_BEGIN
#if defined (__ICCARM__)
#define CY_SECTION_SRAM1_CODE_BEGIN CY_PRAGMA(diag_suppress = Ta023) __ramfunc
#else
#define CY_SECTION_SRAM1_CODE_BEGIN CY_SECTION(".cy_sram1_code")
#endif
#endif

/** Define end of the function placed to the SRAM1 area by the linker */
#ifndef CY_SECTION_SRAM1_CODE_END
#if defined (__ICCARM__)
#define CY_SECTION_SRAM1_CODE_END CY_PRAGMA(diag_default = Ta023)
#else
#define CY_SECTION_SRAM1_CODE_END
#endif
#endif

/** Define start of the function placed to the SRAM1 area by the linker */
#ifndef CY_SECTION_SRAM1_DATANS_BEGIN
#if defined (__ICCARM__)
#define CY_SECTION_SRAM1_DATANS_BEGIN CY_PRAGMA(diag_suppress = Ta023) __ramfunc
#else
#define CY_SECTION_SRAM1_DATANS_BEGIN CY_SECTION(".cy_sram1_data_ns")
#endif
#endif

/** Define end of the function placed to the SRAM1 area by the linker */
#ifndef CY_SECTION_SRAM1_DATANS_END
#if defined (__ICCARM__)
#define CY_SECTION_SRAM1_DATANS_END CY_PRAGMA(diag_default = Ta023)
#else
#define CY_SECTION_SRAM1_DATANS_END
#endif
#endif

/** Define start of the function placed to the SRAM1 area by the linker */
#ifndef CY_SECTION_SRAM0_DATANS_BEGIN
#if defined (__ICCARM__)
#define CY_SECTION_SRAM0_DATANS_BEGIN CY_PRAGMA(diag_suppress = Ta023) __ramfunc
#else
#define CY_SECTION_SRAM0_DATANS_BEGIN CY_SECTION(".cy_sram0_data_ns")
#endif
#endif

/** Define end of the function placed to the SRAM1 area by the linker */
#ifndef CY_SECTION_SRAM0_DATANS_END
#if defined (__ICCARM__)
#define CY_SECTION_SRAM0_DATANS_END CY_PRAGMA(diag_default = Ta023)
#else
#define CY_SECTION_SRAM0_DATANS_END
#endif
#endif


