PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_syslib.h
/*******************************************************************************
* Function Name: Cy_SysLib_EnterCriticalSection
****************************************************************************//**
*
*  Cy_SysLib_EnterCriticalSection disables interrupts and returns a value
*  indicating whether the interrupts were previously enabled.
*
*  \return Returns the current interrupt status. Returns 0 if the interrupts
*          were previously enabled or 1 if the interrupts were previously
*          disabled.
*
*  \note Implementation of Cy_SysLib_EnterCriticalSection manipulates the IRQ
*        enable bit with interrupts still enabled.
*
*******************************************************************************/
uint32_t Cy_SysLib_EnterCriticalSection(void);


/*******************************************************************************
* Function Name: Cy_SysLib_ExitCriticalSection
****************************************************************************//**
*
*  Re-enables the interrupts if they were enabled before
*  Cy_SysLib_EnterCriticalSection() was called. The argument should be the value
*  returned from \ref Cy_SysLib_EnterCriticalSection().
*
*  \param savedIntrStatus  Puts the saved interrupts status returned by
*                          the \ref Cy_SysLib_EnterCriticalSection().
*
*******************************************************************************/
void Cy_SysLib_ExitCriticalSection(uint32_t savedIntrStatus);


/*******************************************************************************
* Function Name: Cy_SysLib_GetDeviceRevision
****************************************************************************//**
*
* This function returns a device Revision ID.
*
* \return  A device Revision ID.
*
*******************************************************************************/
uint8_t Cy_SysLib_GetDeviceRevision(void);

/*******************************************************************************
* Function Name: Cy_SysLib_GetDevice
****************************************************************************//**
*
* This function returns a device Family ID.
*
* \return  A device Family ID.
*
*******************************************************************************/
uint16_t Cy_SysLib_GetDevice(void);


#if  defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SysLib_GetDeviceLCS
****************************************************************************//**
*
* This function returns LCS of Device.
*
* \param base The pointer to the SRSS instance.
*
* \return  \ref cy_en_syslib_lcs_mode_t
*
*******************************************************************************/
cy_en_syslib_lcs_mode_t Cy_SysLib_GetDeviceLCS(cy_syslib_lcs_data_t *base);

/*******************************************************************************
* Function Name: Cy_Syslib_SetWarmBootEntryPoint
****************************************************************************//**
*
* This function will set Warm boot entry point address to a location read by
* BootROM. This function is used only before entering DeepSleep-RAM and not
* effective in any other sleep mode. Before entering CY_SYSPM_MODE_DEEPSLEEP_RAM,
* user needs to set entry point to a function located in RAM Image using
* Cy_Syslib_SetWarmBootEntryPoint(), refer Cy_SysPm_SetDeepSleepMode().
*
*  \param entryPoint Address of the function that needs to be entered after
* WARM boot.
*
*  \param enable Enables/Disables debugging control after DS-RAM wakeup
* i.e. warmboot
*
*******************************************************************************/
void Cy_Syslib_SetWarmBootEntryPoint(uint32_t *entryPoint, bool enable);

/*******************************************************************************
* Function Name: Cy_SysLib_IsDSRAMWarmBootEntry
****************************************************************************//**
*
* This function will return true if the system woke up(From DS-RAM) through
* Warm boot, else it will return false.
*
* \return  Warm Boot Status.
*
*******************************************************************************/
bool Cy_SysLib_IsDSRAMWarmBootEntry(void);

/*******************************************************************************
* Function Name: Cy_SysLib_ClearDSRAMWarmBootEntryStatus
****************************************************************************//**
*
* This function clears the Warm Boot entry Status flag.
*
*******************************************************************************/
void Cy_SysLib_ClearDSRAMWarmBootEntryStatus(void);
#endif

#if (CY_CPU_CORTEX_M55) || (CY_CPU_CORTEX_M7) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_Syslib_IsMemCacheable
****************************************************************************//**
*
* This function checks if the memory address and the size passed falls in the
* non-cacheable region or not.
*
*  \param mpu Address of the MPU
*
*  \param addr Address of the memory to be checked
*
*  \param size Size of the memory to be checked
*
* \note
* This API is available for CM55 core devices.
*
*******************************************************************************/
bool Cy_Syslib_IsMemCacheable(MPU_Type* mpu, uint32_t addr, uint32_t size);
#endif


#define CY_SYSLIB_COEFFICIENT_ULP     (80U) /**< Wait states coefficient for ULP mode  */
#define CY_SYSLIB_COEFFICIENT         (60U) /**< Wait states coefficient for general mode  */

/* SILICON ID Macros */
#define CY_SYSLIB_GET_SILICON_REV_ID         (CY_SILICON_ID & 0xFFFFUL)


typedef uint32_t cy_status;
/** The ARM 32-bit status value for backward compatibility with the UDB components. Do not use it in your code. */
typedef uint32_t cystatus;
typedef uint8_t  uint8;    /**< Alias to uint8_t  for backward compatibility */
typedef uint16_t uint16;   /**< Alias to uint16_t for backward compatibility */
typedef uint32_t uint32;   /**< Alias to uint32_t for backward compatibility */
typedef int8_t   int8;     /**< Alias to int8_t   for backward compatibility */
typedef int16_t  int16;    /**< Alias to int16_t  for backward compatibility */
typedef int32_t  int32;    /**< Alias to int32_t  for backward compatibility */
typedef float    float32;  /**< Alias to float    for backward compatibility */
typedef double   float64;  /**< Alias to double   for backward compatibility */
typedef int64_t  int64;    /**< Alias to int64_t  for backward compatibility */
typedef uint64_t uint64;   /**< Alias to uint64_t for backward compatibility */
/* Signed or unsigned depending on the compiler selection */
typedef char     char8;    /**< Alias to char for backward compatibility */
typedef volatile uint8_t  reg8;   /**< Alias to uint8_t  for backward compatibility */
typedef volatile uint16_t reg16;  /**< Alias to uint16_t for backward compatibility */
typedef volatile uint32_t reg32;  /**< Alias to uint32_t for backward compatibility */

